# Создайте программу медицинская анкета, где вы запросите у пользователя такие данные, как имя, фамилию, возраст, и вес.
# И выведите результат согласно которому пациент в хорошем состоянии, если ему до 30 лет и вес от 50 и до 120 кг,
# Пациенту требуется начать вести правильный образ жизни, если ему более 30 и вес меньше 50 или больше 120 кг
# Пациенту требуется врачебный осмотр, если ему более 40 и вес менее 50 или больше 120 кг.
# Все остальные варианты вы можете обработать на ваш вкус и полет фантазии =)
# Формула не отражает реальной действительности и здесь используется только ради примера.

# Пример: Вася Пупкин, 29 год, вес 90 - хорошее состояние
# Пример: Вася Пупкин, 31 год, вес 121 - следует заняться собой
# Пример: Вася Пупкин, 31 год, вес 49 - следует заняться собой
# Пример: Вася Пупкин, 41 год, вес 121 - следует обратится к врачу!
# Пример: Вася Пупкин, 41 год, вес 49 - следует обратится к врачу!

firstname = input('Введите Ваше имя: ')
lastname = input('Введите Вашу фамилию: ')
age = input('Введите Ваш возраст: ')
weight = input('Введите Ваш вес: ')

if int(age) <= 30 and 50 <= int(weight) <= 120:
    print(firstname + ' ' + lastname + ', ' + age + ' год, вес ' + weight + ' - хорошее состояние')
elif int(age) >= 40 and (int(weight) < 50 or int(weight) > 120):
    print(firstname + ' ' + lastname + ', ' + age + ' год, вес ' + weight + ' - следует обратится к врачу!')
elif int(age) > 30 and (int(weight) < 50 or int(weight) > 120):
    print(firstname + ' ' + lastname + ', ' + age + ' год, вес ' + weight + ' - следует заняться собой')
else:
    print('Затрудняюсь ответить о Вашем состоянии здоровья')
